RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L43x_Firmware_Library/n32l43x_std_periph_driver/src/n32l43x_flash.c
    /* Enable or disable the iCache */
    FLASH->AC &= AC_ICAHEN_MSK;
    FLASH->AC |= FLASH_iCache;
}

/**
 * @brief  Enables or disables the Low Voltage Mode.
 * @note   This function can be used for N32L43x devices.
 * @param FLASH_LVM specifies the Low Voltage Mode status.
 *   This parameter can be one of the following values:
 *     @arg FLASH_LVM_EN  FLASH Low Voltage Mode Enable
 *     @arg FLASH_LVM_DIS FLASH Low Voltage Mode Disable
 */
void FLASH_LowVoltageModeCmd(uint32_t FLASH_LVM)
{
    /* Check the parameters */
    assert_param(IS_FLASH_LVM(FLASH_LVM));

    /* Enable or disable LVM */
    FLASH->AC &= AC_LVMEN_MSK;
    FLASH->AC |= FLASH_LVM;
}

/**
 * @brief  Checks whether the Low Voltage Mode status is SET or RESET.
 * @note   This function can be used for N32L43x devices.
 * @return Low Voltage Mode Status (SET or RESET).
 */
FlagStatus FLASH_GetLowVoltageModeSTS(void)
{
    FlagStatus bitstatus = RESET;

    if ((FLASH->AC & AC_LVMF_MSK) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    /* Return the new state of FLASH Low Voltage Mode Status (SET or RESET) */
    return bitstatus;
}

/**
 * @brief  Enables or disables the FLASH Sleep Mode.
 * @note   This function can be used for N32L43x devices.
 * @param FLASH_SLM specifies the FLASH Sleep Mode status.
 *   This parameter can be one of the following values:
 *     @arg FLASH_SLM_EN  FLASH iCache Enable
 *     @arg FLASH_SLM_DIS FLASH iCache Disable
 */
void FLASH_FLASHSleepModeCmd(uint32_t FLASH_SLM)
{
    /* Check the parameters */
    assert_param(IS_FLASH_SLM(FLASH_SLM));

    /* Enable or disable SLM */
    FLASH->AC &= AC_SLMEN_MSK;
    FLASH->AC |= FLASH_SLM;
}

/**
 * @brief  Checks whether the FLASH Sleep Mode status is SET or RESET.
 * @note   This function can be used for N32L43x devices.
 * @return FLASH Sleep Mode Status (SET or RESET).
 */
FlagStatus FLASH_GetFLASHSleepModeSTS(void)
{
    FlagStatus bitstatus = RESET;

    if ((FLASH->AC & AC_SLMF_MSK) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    /* Return the new state of FLASH Sleep Mode Status (SET or RESET) */
    return bitstatus;
}

/**
 * @brief  Checks whether the FLASH SMPSEL is SMP1 or SMP2.
 * @note   This function can be used for N32L43x devices.
 * @param FLASH_smpsel FLASH_SMPSEL_SMP1 or FLASH_SMPSEL_SMP2
 */
void FLASH_SetSMPSELStatus(uint32_t FLASH_smpsel)
{
    /* Check the parameters */
    assert_param(IS_FLASH_SMPSEL_STATE(FLASH_smpsel));

    /* SMP1 or SMP2 */
    FLASH->CTRL &= CTRL_Reset_SMPSEL;
    FLASH->CTRL |= FLASH_smpsel;
}

/**
 * @brief  Configures the Internal High Speed oscillator
 *         to program/erase FLASH.
 * @note   This function can be used for N32L43x devices.
 *         - For N32L43x devices this function enable HSI.
 * @return FLASH_HSICLOCK (FLASH_HSICLOCK_ENABLE or FLASH_HSICLOCK_DISABLE).
 */
FLASH_HSICLOCK FLASH_ClockInit(void)
{
    bool HSIStatus = 0;
    __IO uint32_t StartUpCounter = 0;
    FLASH_HSICLOCK hsiclock_status = FLASH_HSICLOCK_ENABLE;

    if ((RCC->CTRL & RCC_CTRL_HSIRDF) == RESET)
    {
        /* Enable HSI */
        RCC->CTRL |= ((uint32_t)RCC_CTRL_HSIEN);

        /* Wait till HSI is ready and if Time out is reached exit */
        do
        {
            HSIStatus = RCC->CTRL & RCC_CTRL_HSIRDF;
            StartUpCounter++;
        } while ((HSIStatus == 0) && (StartUpCounter != HSI_STARTUP_TIMEOUT));

        HSIStatus = ((RCC->CTRL & RCC_CTRL_HSIRDF) != RESET);
        if (!HSIStatus)
        {
            hsiclock_status = FLASH_HSICLOCK_DISABLE;
        }
    }
    return hsiclock_status;
}

/**
 * @brief  Unlocks the FLASH Program Erase Controller.
 * @note   This function can be used for N32L43x devices.
 *         - For N32L43x devices this function unlocks Bank.
 *           to FLASH_Unlock function..
 */
void FLASH_Unlock(void)
{
    /* Unlocks the FLASH Program Erase Controller */
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
}

/**
 * @brief  Locks the FLASH Program Erase Controller.
 * @note   This function can be used for N32L43x devices.
 *         - For N32L43x devices this function Locks Bank.
 *           to FLASH_Lock function.
 */
void FLASH_Lock(void)
{
    /* Set the Lock Bit to lock the FLASH Program Erase Controller */
    FLASH->CTRL |= CTRL_Set_LOCK;
}

/**
 * @brief  Erases a specified FLASH page.
 * @note   This function can be used for N32L43x devices.
 * @param Page_Address The page address to be erased.
 * @return FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERR_RDKEY,
 *         FLASH_ERR_PG, FLASH_ERR_PV, FLASH_ERR_WRP, FLASH_COMPL,
 *         FLASH_ERR_EV or FLASH_TIMEOUT.
 */
FLASH_STS FLASH_EraseOnePage(uint32_t Page_Address)
{
    FLASH_STS status = FLASH_COMPL;
    /* Check the parameters */
    assert_param(IS_FLASH_ADDRESS(Page_Address));

    /* Clears the FLASH's pending flags */
    FLASH_ClearFlag(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOpt(EraseTimeout);

    if (status == FLASH_COMPL)
    {
        /* if the previous operation is completed, proceed to erase the page */
        FLASH->CTRL |= CTRL_Set_PER;
        FLASH->ADD = Page_Address;
        FLASH->CTRL |= CTRL_Set_START;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOpt(EraseTimeout);

        /* Disable the PER Bit */
        FLASH->CTRL &= CTRL_Reset_PER;
    }

    /* Return the Erase Status */
    return status;
}

/**
 * @brief  Erases all FLASH pages.
 * @note   This function can be used for all N32L43x devices.
 * @return FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERR_RDKEY,
 *         FLASH_ERR_PG, FLASH_ERR_PV, FLASH_ERR_WRP, FLASH_COMPL,
 *         FLASH_ERR_EV or FLASH_TIMEOUT.
 */
FLASH_STS FLASH_MassErase(void)
{
    FLASH_STS status = FLASH_COMPL;

    /* Clears the FLASH's pending flags */
    FLASH_ClearFlag(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOpt(EraseTimeout);
    if (status == FLASH_COMPL)
    {
        /* if the previous operation is completed, proceed to erase all pages */
        FLASH->CTRL |= CTRL_Set_MER;
        FLASH->CTRL |= CTRL_Set_START;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOpt(EraseTimeout);

